# coding=utf-8
from wxstore.format import TEXT, TEXT_IMG
from wxstore.controller import getMenu, getOrder, getAddr, watchAddr, rmAddr, renameAddr, cancleOrder, urgeOrder, watchOrder, registSeller

REPLY = {
    'h': (TEXT, '欢迎来到店小二服务台，我们将竭诚为您服务！回复m获取菜单，回复o查询并管理订单，回复a查询并管理地址，回复c催单，回复h查看帮助，谢谢惠顾！'),
    'm': (TEXT_IMG, (getMenu, ['这是菜单，图文信息'])),
    'o': (TEXT, (getOrder, ['亲，您没有未完成的订单！', '您的未完成订单：\n', '您可以使用以下命令来管理订单:\n1.查看:o-wc 订单序号\n2.催单:o-urge 订单序号 备注[可选]\n3.取消:o-cancle 订单序号'])),
    'a': (TEXT, (getAddr, ['亲，您还没有任何地址！请在第一次下单时创建属于你的地址吧～', '您的地址有：\n', '您可以使用以下命令来管理地址:\n1.查看:ac 地址名\n2.删除:am 地址名\n3.重命名:av 原地址名 新地址名\n如果您想创建新地址，请在下次下单时创建！'])),
    'c': (TEXT, '您好，我将催促他们快点送货，为您带来的不便请您谅解'),
}

COMMAND = {
    'ac': (watchAddr, ["亲，您的格式不对，查看地址:addr-wc 地址名", "亲，该地址不存在！"]),
    'am': (rmAddr, ["亲，您的格式不对，删除地址:addr-rm 地址名", "亲，该地址本就不存在哦～", "亲，您已成功删除"]),
    'av': (renameAddr, ["亲，您的格式不对，重命名地址:addr-mv 原地址名 新地址名", "亲，该地址名本就不存在哦～", "亲，您的新名字太长了，影响显示，请把字符数控制在7个以内", "亲，你已成功重命名地址"]),
    'o-wc': (watchOrder, ["亲，您的格式不对，查看订单:o-wc 订单序号", "亲，您是没有订单还是输入的订单序号太大了。。请输入o查询订单。", "啊哈，此订单您购买了"]),
    'o-urge': (urgeOrder, ["亲，您的格式不对，催促订单:o-urge 订单序号 您想对派件员说的话[可选]", "亲，您是没有订单还是输入的订单序号太大了。。请输入o查询订单。", "我已告诉派件员此订单十万火急！"]),
    'o-cancle': (cancleOrder, ["亲，您的格式不对，取消订单:o-cancle 订单序号", "亲，您没有订单或者输入的订单序号太大了，请输入o查询订单。", "亲，您已成功取消订单"]),
    'regist': (registSeller, ["亲，您的格式不对，注册商户:regist 手机号 密码", "该手机号没有登记或者密码错误", "对不起，您的微信号已经注册过商家，请另外选择微信号绑定！", "恭喜您，您已成功注册为我们的商家，我们将竭诚为您服务！"]),
}
